import fleep

dic = {'A': 'А', 'a': 'а', 'B': 'Б', 'b': 'б', 'C': 'Ц', 'c': 'ц', 'D': 'Д', 'd': 'д', 'E': 'Е', 'e': 'е',
	   'F': 'Ф', 'f': 'ф', 'G’': 'г', 'g': 'г', 'H': 'Х', 'h': 'х', 'I': 'И', 'i': 'и', 'J': 'Дж', 'j': 'дж',
	   'K': 'К', 'k': 'к', 'L': 'Л', 'l': 'л', 'M': 'М', 'm': 'м', 'N': 'Н', 'n': 'н', 'O': 'О', 'o': 'о',
	   'P': 'П', 'p': 'п', 'Q': 'Кв', 'q': 'кв', 'R': 'Р', 'r': 'р', 'S': 'С', 's': 'c', 'T': 'Т', 't': 'т',
	   'U': 'У', 'u': 'у', 'V': 'В', 'v': 'в', 'W': 'В', 'w': 'в', 'X': 'Кс', 'x': 'кс', 'Y': 'Й', 'y': 'й',
	   'Z': 'З', 'z': 'з'}

alphabet = ['А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я','а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я']


with open('test2.doc', 'r') as f:
	lines = f.read().splitlines()
file = open('test2.doc', "w")
for line in lines:
	file.write((''.join([dic.get(char, char) for char in line])))

file = open('test2.doc', "r")
print(file.read())
file.close()	